<blank>
<unk>
<eos>
the
?
in
is
of
what
a
,
was
did
to
city
(
)
country
and
which
's
who
-
how
for
american
state
when
on
new
by
with
from
as
capital
company
many
that
europe
england
east
does
are
south
first
valencia
where
largest
us
name
north
at
united
an
asia
were
most
year
located
"
london
singer
africa
after
france
has
west
have
india
spain
island
china
region
date
number
states
university
area
york
haven
songwriter
population
be
people
war
.
america
british
world
barcelona
republic
its
during
officially
much
greece
middle
former
kingdom
his
oklahoma
part
other
had
one
president
it
known
southampton
madonna
film
along
carolina
county
beyoncé
washington
egypt
between
territory
third
idol
germany
community
language
john
u.s.
australia
french
italy
do
switzerland
football
place
houston
san
their
type
two
saint
autonomous
nanjing
second
connecticut
used
texas
dell
school
continent
plymouth
century
paris
populous
seattle
computer
central
portugal
television
been
tennessee
florida
mexico
melbourne
english
apple
notre
dame
become
about
california
called
nigeria
'
detroit
government
richmond
percentage
major
town
northern
oceania
german
miami
tuvalu
japan
rome
iran
israel
group
boston
national
into
balkans
southern
team
time
season
estonia
up
music
game
than
technology
over
leader
madrid
empire
armenia
delhi
would
league
canada
chinese
church
long
river
hyderabad
king
michigan
kanye
mary
religious
tucson
province
roman
norfolk
western
tibet
ocean
general
or
military
virginia
cyprus
book
namibia
census
public
philosopher
libya
also
union
station
quran
great
atlantic
russia
center
record
valència
ireland
not
take
begin
system
political
european
college
abbey
home
politician
bermuda
years
party
victoria
based
korea
airport
diego
work
nintendo
use
queen
massachusetts
led
large
live
more
antarctica
made
2010
park
out
there
sea
mountain
brazil
found
ii
near
arizona
britain
famous
all
district
album
designated
under
founded
rank
khan
being
charleston
official
warsaw
created
against
high
spanish
bbc
international
neighborhood
ibm
wrote
day
organization
end
born
borough
reason
video
make
minister
i
artist
comcast
water
border
her
considered
italian
only
emperor
westminster
street
2015
win
won
this
series
broadcasting
sanskrit
three
indian
alaska
term
became
whom
napoleon
land
countries
main
chicago
guinea
why
get
radio
house
indiana
show
metropolitan
federal
highest
popular
building
named
song
he
st.
before
text
cities
eritrea
player
bowl
air
media
2011
held
coast
service
battle
prussia
square
avicenna
overseas
since
period
australian
whose
amount
super
poet
somalia
built
george
power
spoken
start
can
control
residents
said
eastern
stadium
helena
released
greek
early
genghis
kind
top
member
come
last
some
network
around
according
army
scotland
william
death
tajikistan
guam
nation
court
port
medical
electronics
actor
they
pakistan
charles
de
miles
dutch
governor
average
bissau
event
prime
architect
2007
among
students
2013
areas
earth
poland
islands
economy
soviet
2008
business
came
austria
author
independent
philadelphia
total
pacific
japanese
sports
cork
2009
2012
go
downtown
netherlands
punjab
times
million
bern
die
raleigh
responsible
play
turkey
took
form
percent
telecommunications
could
best
municipality
writer
lived
yale
james
zhejiang
al
latin
line
receive
caused
spectre
private
thuringia
religion
channel
notable
2014
windows
through
department
seat
given
art
range
helped
support
established
band
foreign
history
economic
records
consumer
besides
biggest
hardware
black
polymath
rule
alps
movie
producer
back
trade
harbor
2000
thomas
borders
schools
persian
paul
originally
law
award
important
rate
actress
premier
research
oldest
terms
canadian
call
samoa
muhammad
historian
financial
rapper
torch
jersey
sichuan
kenya
virgil
late
composer
title
label
chopin
played
outside
often
until
director
hanover
modern
ruler
far
still
original
rock
mathematician
climate
forces
ibn
iii
cbc
industry
set
independence
treaty
montevideo
head
troops
both
southeast
free
later
bordered
believe
education
professional
2005
dynasty
person
off
joseph
ancient
join
parliament
russian
developed
robert
published
david
temperature
henry
each
road
mayor
another
run
palermo
francisco
child
2006
old
attack
style
baseball
northwest
greater
entertainment
lake
yugoslavia
like
force
money
month
pubs
influence
pennsylvania
star
competition
release
professor
engineer
museum
members
oil
travel
lee
prior
broadcast
help
galicia
cbs
palace
economist
produced
8
reach
nations
per
club
special
languages
uruguay
montana
life
corporation
position
settlement
role
types
sicily
beijing
formed
ranked
leave
host
rajasthan
current
elected
sun
pope
uk
los
syria
side
native
operating
manhattan
louis
swiss
royal
studio
big
occur
von
illinois
within
served
age
primary
martin
catholic
officer
musical
journalist
production
referred
move
word
3
gdp
luther
invade
agency
location
musician
multinational
beyonce
nasser
fall
sovereign
sell
mass
marshall
services
hold
wales
version
began
visit
change
replaced
send
theory
featured
mount
african
angeles
iraq
brought
ali
luftwaffe
open
several
own
well
campus
bay
tito
strasbourg
fresno
headquarters
arab
sold
council
liberia
similar
works
zealand
runs
natural
believed
majority
freddie
games
defeated
southeastern
2004
division
northeast
headquartered
hong
program
she
recorded
happened
polish
edward
father
market
body
hosted
point
commercial
village
constitution
physician
introduced
following
field
pay
approximately
rights
order
owned
estimated
muslim
footballer
20th
office
prominent
gave
mediterranean
tv
establish
kong
statesman
novel
portion
newcastle
may
culture
act
stations
peter
write
populated
science
species
close
give
companies
console
doctor
peninsula
study
but
visited
rail
surrender
architecture
senator
moved
2001
started
list
create
direction
/
human
lofting
pub
present
singapore
ann
regions
announce
common
hit
michael
plan
using
olympic
cultural
ruled
designed
status
say
counties
rhine
tourists
vote
son
secretary
lancashire
mongol
cathedral
space
single
describe
19th
playstation
universal
spielberg
once
2003
compared
metro
now
significant
return
lead
alexandria
want
tour
eisenhower
christian
caribbean
received
philosophy
planet
10
%
relationship
provide
feature
arts
hall
associated
result
jews
property
written
development
man
due
election
valley
businessman
serve
killed
currently
agreement
days
products
territories
bible
size
scottish
died
plant
albert
era
because
gaddafi
sony
arbor
available
physicist
prince
administrative
urban
level
will
cable
sent
movement
santa
fourth
january
enter
real
gain
figure
richard
share
gothic
activity
macintosh
nepal
produce
conference
residential
colony
away
bank
highway
thought
2002
influenced
capture
mexican
alsace
schwarzenegger
local
domestic
peace
library
settle
ship
magazine
teams
islamic
provided
explorer
missouri
chief
revolution
imperial
speak
left
while
internet
universities
supported
nfl
decade
landlocked
historical
red
signed
living
down
weather
sir
model
worked
claim
singing
fire
pop
news
march
supreme
so
groups
allowed
asian
you
such
democratic
broadway
novelist
way
hampshire
build
mercury
mali
avenue
alexander
executive
directed
shore
events
genocide
jewish
parts
lose
see
romanized
inventor
higher
lost
having
hemisphere
site
summer
scholar
contemporary
basketball
women
operation
judge
harper
hayek
situated
annual
taken
colorado
inhabitants
11
men
abc
immigrants
mainly
store
cup
female
civil
beer
manager
interstate
vietnam
contestant
family
islam
train
catalonia
social
austrian
them
inn
arena
kansas
deal
50
s
greatest
pictures
1
7th
coastal
saw
june
reported
every
jobs
growth
addition
ethiopia
daily
francis
retail
four
occupied
portuguese
discovered
newfoundland
dst
knowles
rise
itself
citizens
conflict
residence
newton
reside
final
sound
simon
geographical
relay
revolutionary
appear
across
ceo
find
jackson
ranking
ended
somerset
offer
charge
ottoman
jacksonville
quantity
wanted
sixth
if
presidential
traditional
communist
same
newspaper
kentucky
good
prize
mostly
carter
founding
collegiate
white
april
right
race
kill
pass
settlers
described
primarily
forms
source
forced
opened
bc
labrador
navy
alternatively
opera
conquered
la
today
commonwealth
districts
pearl
fashion
belong
suez
policy
itunes
police
ptolemy
bridge
different
irish
performed
canal
children
view
report
caucasus
regional
awards
cross
byu
theater
seasons
jerusalem
collection
alpine
global
olympics
six
increase
software
instead
institute
berlin
route
painter
joined
el
transcontinental
included
festival
formally
speaking
15
invaded
lawyer
granted
cover
kerry
bush
invasion
founder
starting
throughout
stop
branch
legend
arrive
eventually
no
institution
centre
fifth
winter
typically
2
n't
1945
provides
employed
refer
nanking
noted
hellenic
airline
half
buildings
makes
defeat
previously
:
try
ohio
giselle
crime
names
bought
contains
attempt
leaving
nbc
working
tom
monk
light
design
nickname
claimed
operate
process
standard
partner
student
occupy
sector
scientist
attacked
churches
sudan
americans
satellite
key
mockingbird
launched
october
full
script
warner
southwest
quarterback
example
mark
thames
energy
zelda
augustus
mountains
launch
purchase
cubs
pod
indigenous
fifa
facility
effect
northeastern
lines
academy
investment
fort
jefferson
mainland
1939
railway
jiangsu
princess
any
freedom
ten
provinces
shares
grand
disney
those
republican
five
tibetan
fought
announced
declare
little
product
perform
saxony
administration
seven
strong
justin
usa
1991
&
2016
sales
serves
jesus
removed
related
involved
format
somali
sign
manufacturing
transport
quant_o_1
coach
permanent
section
tower
him
columbia
went
ban
vi
temperatures
co.
broz
transportation
annexed
entrepreneur
brooklyn
systems
gas
films
buy
else
alliance
slaves
beat
interest
uefa
kilometres
1998
entity
going
commander
leading
relations
theologian
accused
reputation
connected
larger
arkansas
bronx
gin
exist
idea
thailand
denver
alumni
corner
decided
include
hudson
via
victory
decline
gold
incorporated
peak
establishment
afrikaans
critic
rather
action
successful
god
hungary
should
paid
railroad
mongolia
smith
winner
winning
playing
philippines
ethnic
attend
cost
security
lot
drinking
wars
acquire
base
food
romans
feel
bordering
owns
transfer
gulf
18th
nine
score
ships
credited
portsmouth
fight
precipitation
declared
archives
pianist
occupation
houses
hospital
1999
designer
dancer
seen
bus
employees
covered
animals
taylor
mother
heart
bill
project
jan
arsenal
aristotle
buckingham
spent
densely
divided
consists
nationality
authority
stand
studied
israeli
mean
assistance
speech
attended
genre
1979
argentina
nicholas
together
cotton
1980s
lies
society
plateau
williams
ports
snow
$
think
kelly
wall
wii
puerto
green
very
2019
career
st
kilometers
color
baltic
chain
remain
adult
stone
cambridge
put
songs
somaliland
judges
inspired
theatre
hollywood
august
translation
sometimes
foot
cause
july
ltd.
copies
stated
twilight
tourist
queens
bell
issue
tallest
czech
apollo
georgia
secondary
1997
ago
southwestern
;
louisiana
families
whitney
j.
connect
regarding
represent
carnival
transit
indonesia
construction
starred
3rd
monica
rca
tried
friedrich
campaign
recognized
steven
geographic
meet
powers
enlightenment
ages
chengdu
eton
seoul
clarkson
split
w.
plato
broadcaster
yuan
decide
eastenders
birth
graduate
iranian
broadcasts
vienna
need
goods
happen
abu
even
expand
buried
20
himself
visitors
shell
wrestler
epic
whitehead
supply
revenue
grow
everton
broncos
smallest
''
practice
beginning
1990
sydney
operates
ordered
pradesh
hawaii
frequently
expansion
valencian
allies
connects
uses
creation
online
focus
miller
awarded
parliamentary
including
failed
programming
colleges
adam
muslims
influential
caesar
ad
contract
link
presbyterian
health
charter
consider
success
months
debut
hill
aid
agree
towards
carried
alfred
ciccone
traffic
device
penalty
flag
low
vice
frédéric
santo
soldiers
value
initially
industrial
1990s
microsoft
steve
stay
parks
alan
continental
hotel
returned
louise
korean
1941
without
above
6
afl
northwestern
v.
examples
offers
somalis
nuclear
able
notably
shows
1964
february
jr.
most-populous
chairman
normandy
venue
hamilton
roger
listed
programs
controlled
nobel
tropical
commonly
speakers
board
annually
hellas
scientific
invented
1949
added
pc
income
structure
philip
develop
banks
nasa
mission
rivers
inc.
running
benefit
prague
candidate
justice
literature
uranium
dominican
naval
match
bond
burma
landmark
love
concert
introduce
criticized
athlete
belgium
governed
ontario
levels
afghanistan
merchant
issues
formerly
small
earliest
usually
married
homes
dominated
case
boeing
albania
hills
lack
worldwide
resident
closed
experience
cyclone
kennedy
publish
priest
fund
holland
centuries
suburb
montreal
ever
competitions
armed
settled
direct
spread
add
lebanon
johnny
castile
julius
labour
nankin
isles
widely
patrick
strike
airlines
offices
runner
renamed
yerevan
places
tourism
1860
liga
hurricane
ipod
purchased
nba
heavily
transferred
entirely
affiliated
academic
compete
eurasia
arabia
shown
completed
comedy
rival
diplomat
kings
done
information
exported
fuller
regarded
adjacent
marks
catalan
maryland
sport
crowned
met
soccer
establishments
historically
7
gupta
arms
these
proposed
personality
degrees
ming
plants
dialect
protestant
least
astronomer
mile
tribes
graduated
sweden
degree
september
though
samuel
problems
vatican
woman
churchill
historic
replace
tax
bishop
presence
fame
ferry
stores
linguist
libyan
fraction
birds
restaurants
artists
paper
stalin
week
1970
dj
spend
editor
lowest
elizabeth
consul
prussian
rico
publishing
virgin
inland
constitutional
post
--
millennia
laws
almost
destroyed
legal
temple
claims
tunisia
buddhism
champions
currency
blue
cape
kept
entire
denmark
nigerian
zone
ukraine
officials
1st
association
navigator
marvel
arctic
seventh
duke
castle
books
burke
impact
quant_s_1
16th
winston
5
workers
performance
changed
density
subject
acquired
keep
ice
tavern
decision
next
attacks
ottomans
eu
1974
darwin
defense
homer
congress
appointed
allow
hungarian
plaza
investor
tradition
studies
december
byzantine
1937
internationally
marie
situation
agricultural
creating
convention
titled
just
drive
12
collins
commune
yongle
class
november
studios
pump
recently
elton
tripoli
cruyff
existed
grant
jay
1994
reign
crisis
fc
frank
kim
factor
foundation
champion
billion
screenwriter
divisions
sinai
principal
cardinal
resulted
swedish
azerbaijan
reserves
edison
compare
occurred
character
boundary
russians
remained
digital
